# 09: Membagi Data Frame menjadi dua secara acak
# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13   9   3  12  16
1   9  16  17  14  16
2  13  12   6  14  17
3   5   2   6  18   4
4   8   7   8  18  15
5   5  18   5   6  17
6   3  10   3  11  12
7  13  12   8  11  14
8  16   1  11   8   1
9  10   7   4  14  18

# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentudf.shape

In [4]:
df.shape

(10, 5)

In [5]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [6]:
df_1

    A   B   C   D   E
3   5   2   6  18   4
9  10   7   4  14  18
4   8   7   8  18  15
0  13   9   3  12  16
8  16   1  11   8   1
6   3  10   3  11  12
5   5  18   5   6  17

In [7]:
df_2

    A   B   C   D   E
1   9  16  17  14  16
2  13  12   6  14  17
7  13  12   8  11  14

# 10: Mengganti nama (label) kolom pada Data Frame berdasarkan pola
# Import Modules

In [8]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [11]:
df = pd.read_csv('../DATTA/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _

In [ ]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

# Memangkas kelebihan spasi pada nama kolom

In [ ]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

# 11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc
# Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

# Persiapan Data Frame

In [ ]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

# Seleksi kolom dan baris menggunakan loc

In [ ]:
df.loc[[0,3,4], ['B','E']]

# Seleksi baris dengan kondisi

In [ ]:
df.loc[df['B']>10, ['B','D','E']]

# Slicing Data Frame dengan loc

In [ ]:
df.loc[0:4, 'B':'D']

# 12: Membentuk kolom bertipe datetime dari sejumlah kolom lain pada Data Frame
# Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

# Persiapan Data Frame

In [ ]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

# Membentuk kolom bertipe datetime

In [ ]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

In [ ]:
df.dtypes